Repository: skroggel/typo3-gadgeto-google
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# extConf.apiHookTables
source: Comma-separated list of tables for which an API request should start when saving in the backend
de: Kommaseparaierte Liste der Tabellen, für die bei der Speicherung im Backend eine API-Abfrage starten soll

# extConf.defaultCountry
source: ISO country code of the country that is used by default for all addresses if no other value is specified
de: ISO-Ländercode des Landes, dass standardmäßig für alle Adressen verwendet wird, sofern kein anderer Wert angegeben ist

# extConf.removeFields
source: Comma-separated list of fields that are to be hidden in the data record "Location".
de: Komma-separarierte Liste von Feldern, die im Datensatz "Location" ausgeblendet werden sollen.

# extConf.pluginsWithHeader
source: Comma-separated list of plugins with header-field in the backend.
de: Komma-separarierte Liste von Plugins mit Überschrift-Feld im Backend.

# plugin.tx_gadgetogoogle_map.title
source: Google Map with Filters and Search, optional with List
de: Google Map mit Suche und Filtern, optional mit Liste

# plugin.tx_gadgetogoogle_map.description
source: Displays locations on a map, enables a radius search for addresses, and allows filtering by category. The results list can be displayed optionally.
de: Zeigt Orte auf einer Karte an, ermöglicht die Umkreissuche nach Adressen und eine Filterung nach Kategorie. Optional kann die Ergebnisliste angezeigt werden.

# plugin.tx_gadgetogoogle_detail.title
source: Details of a location
de: Details eines Standortes

# plugin.tx_gadgetogoogle_detail.description
source: Shows the detailed view of a single location with all available information.
de: Zeigt die Detailansicht eines einzelnen Standorts mit allen verfügbaren Informationen.

# plugin.tx_gadgetogoogle_list.title
source: List of locations
de: Liste der Standorte

# plugin.tx_gadgetogoogle_list.description
source: Displays all locations clearly as a list, grouped by category and with a scroll function for large amounts of data.
de: Stellt alle Standorte übersichtlich als Liste dar, gruppiert nach Kategorien und mit Blätterfunktion für große Datenmengen.

# plugin.tx_gadgetogoogle_teaser.title
source: Teaser for locations
de: Teaser für Standorte

# plugin.tx_gadgetogoogle_teaser.description
source: Displays selected locations as teasers. The locations to be displayed can be selected manually in the plugin.
de: Zeigt ausgewählte Standorte als Teaser. Die anzuzeigenden Locations können im Plugin manuell gewählt werden.

# contentElementWizward.header
source: Locations
de: Standorte

# flexform.tab.common
source: Common
de: Allgemein

# flexform.tab.view
source: View
de: Ansicht

# flexform.tab.list
source: List
de: Liste

# flexform.tab.search
source: Search
de: Suche

# flexform.settings.locationCenter
source: Location in center of map (otherwise map scales so that all locations are visible)
de: Standort im Zentrum der Karte (sonst skaliert Karte sich so, dass alle Standorte sichtbar sind)

# flexform.settings.locations
source: Shown locations (if empty, all locations are shown)
de: Angezeigte Standorte (wenn leer, werden alle angezeigt)

# flexform.settings.showSearch
source: Show search
de: Suche anzeigen

# flexform.settings.showList
source: Show list
de: Liste anzeigen

# flexform.settings.hideFilter
source: Hide filter for pins
de: Filter für Pins ausblenden

# flexform.settings.detailPage
source: Detail page with plugin
de: Detail-Seite mit Plugin

# flexform.settings.maxSearchRadius
source: Maximum radius for search (in kilometers, 0 = unlimited)
de: Maximaler Suchradius (in Kilometer, 0 = unbegrenzt)

# flexform.settings.maxSearchDisplayRadius
source: Maximum radius of results that is shown on the map (in kilometers, 0 = unlimited)
de: Maximaler Radius für Anzeige der Suchergebnisse auf der Karte (in Kilometer, 0 = unbegrenzt)

# flexform.settings.defaultCountry
source: Default Country for search (e.g. "DE")
de: Standard-Land für Suche (z.B. "DE")

# flexform.settings.maxResultsPerPage
source: Maximum number of results per Page
de: Maximale Anzahl an Ergebnissen je Seite

# flexform.settings.maxPages
source: Maximum number of pages shown
de: Maximale Anzahl an Seiten

# flexform.settings.hidePagination
source: Hide pagination
de: Pagination ausblenden

# flexform.settings.paginationStyle
source: Pagination style
de: Paginationstil

# flexform.settings.paginationStyle.default
source: Default
de: Standard

# flexform.settings.paginationStyle.more
source: Show more
de: Mehr anzeigen

# flexform.settings.listStyle
source: List style
de: Listenstil

# flexform.settings.listStyle.default
source: Default
de: Standard

# flexform.settings.listStyle.category
source: Group by category
de: Nach Kategorien gruppieren

# flexform.settings.layout
source: Layout
de: Darstellung

# flexform.settings.layout.default
source: Default
de: Standard

# flexform.settings.layout.big
source: Big
de: Groß
